renesas/rx-driver-package/source/r_rsip_protected_rx/r_rsip_protected_rx_vx.xx/r_rsip_protected_rx/src/private/rx261/r_rsip_private.c
/***********************************************************************************************************************
* DISCLAIMER
* This software is supplied by Renesas Electronics Corporation and is only intended for use with Renesas products. No
* other uses are authorized. This software is owned by Renesas Electronics Corporation and is protected under all
* applicable laws, including copyright laws.
* THIS SOFTWARE IS PROVIDED "AS IS" AND RENESAS MAKES NO WARRANTIES REGARDING
* THIS SOFTWARE, WHETHER EXPRESS, IMPLIED OR STATUTORY, INCLUDING BUT NOT LIMITED TO WARRANTIES OF MERCHANTABILITY,
* FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT. ALL SUCH WARRANTIES ARE EXPRESSLY DISCLAIMED. TO THE MAXIMUM
* EXTENT PERMITTED NOT PROHIBITED BY LAW, NEITHER RENESAS ELECTRONICS CORPORATION NOR ANY OF ITS AFFILIATED COMPANIES
* SHALL BE LIABLE FOR ANY DIRECT, INDIRECT, SPECIAL, INCIDENTAL OR CONSEQUENTIAL DAMAGES FOR ANY REASON RELATED TO THIS
* SOFTWARE, EVEN IF RENESAS OR ITS AFFILIATES HAVE BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.
* Renesas reserves the right, without notice, to make changes to this software and to discontinue the availability of
* this software. By using this software, you agree to the additional terms and conditions found by accessing the
* following link:
* http://www.renesas.com/disclaimer
*
* Copyright (C) 2024 Renesas Electronics Corporation. All rights reserved.
***********************************************************************************************************************/
/***********************************************************************************************************************
* File Name    : r_rsip_private.c
* Description  : Interface definition for the RSIP private layer.
***********************************************************************************************************************/
/**********************************************************************************************************************
* History : DD.MM.YYYY Version  Description
*         : 15.10.2024 1.00     First Release.
***********************************************************************************************************************/

/***********************************************************************************************************************
 * Includes
 **********************************************************************************************************************/
#include <stdio.h>
#include <string.h>
#include "r_rsip_protected_rx_if.h"
#include "r_rsip_public.h"
#include "r_rsip_private.h"
#include "r_rsip_wrapper.h"
#include "../../primitive/rx261/r_rsip_primitive.h"

/***********************************************************************************************************************
 * Macro definitions
 **********************************************************************************************************************/
/* For HMAC-SHA */
#define RSIP_PRV_WORD_SIZE_HMAC_MAC_BUFFER                  (8U)

/* For AES-ECB/CBC/CTR */
#define RSIP_PRV_CMD_AES_CIPHER_ECB_ENCRYPT    (0U)
#define RSIP_PRV_CMD_AES_CIPHER_ECB_DECRYPT    (1U)
#define RSIP_PRV_CMD_AES_CIPHER_CBC_ENCRYPT    (2U)
#define RSIP_PRV_CMD_AES_CIPHER_CBC_DECRYPT    (3U)
#define RSIP_PRV_CMD_AES_CIPHER_CTR_CRYPT      (4U)

/* Primitive function names */
#if RSIP_CFG_AES_128_ENABLE
    #define RSIP_PRV_FUNC_KEY_GENERATE_AES_128                 r_rsip_p07
    #define RSIP_PRV_FUNC_KEY_WRAP_AES_128                     r_rsip_wrapper_p6f_aes128
    #define RSIP_PRV_FUNC_INIT_KEY_WRAP_AES_128                r_rsip_p6e_aes128
    #define RSIP_PRV_FUNC_RFC3394_AES_128_KEY_WRAP             r_rsip_wrapper_p8f_aes128
    #define RSIP_PRV_FUNC_RFC3394_AES_128_KEY_UNWRAP           r_rsip_wrapper_p90_aes128
    #if RSIP_CFG_AES_ECB_CBC_CTR_ENABLE
        #define RSIP_PRV_FUNC_AES_CIPHER_INIT_ECB_ENC_128         r_rsip_wrapper_p47i_aes128ecb_encrypt
        #define RSIP_PRV_FUNC_AES_CIPHER_INIT_ECB_DEC_128         r_rsip_wrapper_p47i_aes128ecb_decrypt
        #define RSIP_PRV_FUNC_AES_CIPHER_INIT_CBC_ENC_128         r_rsip_wrapper_p47i_aes128cbc_encrypt
        #define RSIP_PRV_FUNC_AES_CIPHER_INIT_CBC_DEC_128         r_rsip_wrapper_p47i_aes128cbc_decrypt
        #define RSIP_PRV_FUNC_AES_CIPHER_INIT_CTR_128             r_rsip_wrapper_p47i_aes128ctr_crypt
        #define RSIP_PRV_FUNC_AES_CIPHER_UPDATE_128               r_rsip_p47u
        #define RSIP_PRV_FUNC_AES_CIPHER_FINAL_128                r_rsip_p47f
    #else
        #define RSIP_PRV_FUNC_AES_CIPHER_INIT_ECB_ENC_128         NULL
        #define RSIP_PRV_FUNC_AES_CIPHER_INIT_ECB_DEC_128         NULL
        #define RSIP_PRV_FUNC_AES_CIPHER_INIT_CBC_ENC_128         NULL
        #define RSIP_PRV_FUNC_AES_CIPHER_INIT_CBC_DEC_128         NULL
        #define RSIP_PRV_FUNC_AES_CIPHER_INIT_CTR_128             NULL
        #define RSIP_PRV_FUNC_AES_CIPHER_UPDATE_128               NULL
        #define RSIP_PRV_FUNC_AES_CIPHER_FINAL_128                NULL
    #endif
#else
    #define RSIP_PRV_FUNC_KEY_GENERATE_AES_128                 NULL
    #define RSIP_PRV_FUNC_KEY_WRAP_AES_128                     NULL
    #define RSIP_PRV_FUNC_INIT_KEY_WRAP_AES_128                NULL
    #define RSIP_PRV_FUNC_RFC3394_AES_128_KEY_WRAP             NULL
    #define RSIP_PRV_FUNC_RFC3394_AES_128_KEY_UNWRAP           NULL
    #define RSIP_PRV_FUNC_AES_CIPHER_INIT_ECB_ENC_128          NULL
    #define RSIP_PRV_FUNC_AES_CIPHER_INIT_ECB_DEC_128          NULL
    #define RSIP_PRV_FUNC_AES_CIPHER_INIT_CBC_ENC_128          NULL
    #define RSIP_PRV_FUNC_AES_CIPHER_INIT_CBC_DEC_128          NULL
    #define RSIP_PRV_FUNC_AES_CIPHER_INIT_CTR_128              NULL
    #define RSIP_PRV_FUNC_AES_CIPHER_UPDATE_128                NULL
    #define RSIP_PRV_FUNC_AES_CIPHER_FINAL_128                 NULL
#endif
#if RSIP_CFG_AES_GCM_ENABLE
    #define RSIP_PRV_FUNC_AES_GCM_ENC_INIT_128                 r_rsip_wrapper_p29i_aes128gcm_encrypt
    #define RSIP_PRV_FUNC_AES_GCM_ENC_UPDATE_AAD_128           r_rsip_p29a
    #define RSIP_PRV_FUNC_AES_GCM_ENC_UPDATE_TRANSITION_128    r_rsip_p29t
    #define RSIP_PRV_FUNC_AES_GCM_ENC_UPDATE_128               r_rsip_p29u
    #define RSIP_PRV_FUNC_AES_GCM_ENC_FINAL_128                r_rsip_p29f
    #define RSIP_PRV_FUNC_AES_GCM_DEC_INIT_128                 r_rsip_wrapper_p32i_aes128gcm_decrypt
    #define RSIP_PRV_FUNC_AES_GCM_DEC_UPDATE_AAD_128           r_rsip_p32a
    #define RSIP_PRV_FUNC_AES_GCM_DEC_UPDATE_TRANSITION_128    r_rsip_p32t
    #define RSIP_PRV_FUNC_AES_GCM_DEC_UPDATE_128               r_rsip_p32u
    #define RSIP_PRV_FUNC_AES_GCM_DEC_FINAL_128                r_rsip_p32f
#else
    #define RSIP_PRV_FUNC_AES_GCM_ENC_INIT_128                 NULL
    #define RSIP_PRV_FUNC_AES_GCM_ENC_UPDATE_AAD_128           NULL
    #define RSIP_PRV_FUNC_AES_GCM_ENC_UPDATE_TRANSITION_128    NULL
    #define RSIP_PRV_FUNC_AES_GCM_ENC_UPDATE_128               NULL
    #define RSIP_PRV_FUNC_AES_GCM_ENC_FINAL_128                NULL
    #define RSIP_PRV_FUNC_AES_GCM_DEC_INIT_128                 NULL
    #define RSIP_PRV_FUNC_AES_GCM_DEC_UPDATE_AAD_128           NULL
    #define RSIP_PRV_FUNC_AES_GCM_DEC_UPDATE_TRANSITION_128    NULL
    #define RSIP_PRV_FUNC_AES_GCM_DEC_UPDATE_128               NULL
    #define RSIP_PRV_FUNC_AES_GCM_DEC_FINAL_128                NULL
#endif
#if RSIP_CFG_AES_CCM_ENABLE
    #define RSIP_PRV_FUNC_AES_CCM_ENC_INIT_128                 r_rsip_wrapper_p95i_aes128ccm_encrypt
    #define RSIP_PRV_FUNC_AES_CCM_ENC_UPDATE_128               r_rsip_p95u
    #define RSIP_PRV_FUNC_AES_CCM_ENC_FINAL_128                r_rsip_wrapper_p95f_aes128ccm_encrypt
    #define RSIP_PRV_FUNC_AES_CCM_DEC_INIT_128                 r_rsip_wrapper_p98i_aes128ccm_decrypt
    #define RSIP_PRV_FUNC_AES_CCM_DEC_UPDATE_128               r_rsip_p98u
    #define RSIP_PRV_FUNC_AES_CCM_DEC_FINAL_128                r_rsip_wrapper_p98f_aes128ccm_decrypt
#else
    #define RSIP_PRV_FUNC_AES_CCM_ENC_INIT_128                 NULL
    #define RSIP_PRV_FUNC_AES_CCM_ENC_UPDATE_128               NULL
    #define RSIP_PRV_FUNC_AES_CCM_ENC_FINAL_128                NULL
    #define RSIP_PRV_FUNC_AES_CCM_DEC_INIT_128                 NULL
    #define RSIP_PRV_FUNC_AES_CCM_DEC_UPDATE_128               NULL
    #define RSIP_PRV_FUNC_AES_CCM_DEC_FINAL_128                NULL
#endif
#if RSIP_CFG_AES_CMAC_ENABLE
    #define RSIP_PRV_FUNC_AES_MAC_INIT_128                     r_rsip_wrapper_p41i_aes128mac
    #define RSIP_PRV_FUNC_AES_MAC_UPDATE_128                   r_rsip_p41u
    #define RSIP_PRV_FUNC_AES_MAC_GENERATE_FINAL_128           r_rsip_wrapper_p41f_aes128mac_generate
    #define RSIP_PRV_FUNC_AES_MAC_VERIFY_FINAL_128             r_rsip_wrapper_p41f_aes128mac_verify
#else
    #define RSIP_PRV_FUNC_AES_MAC_INIT_128                     NULL
    #define RSIP_PRV_FUNC_AES_MAC_UPDATE_128                   NULL
    #define RSIP_PRV_FUNC_AES_MAC_GENERATE_FINAL_128           NULL
    #define RSIP_PRV_FUNC_AES_MAC_VERIFY_FINAL_128             NULL
#endif

#if RSIP_CFG_AES_256_ENABLE
    #define RSIP_PRV_FUNC_KEY_GENERATE_AES_256                 r_rsip_p08
    #define RSIP_PRV_FUNC_KEY_WRAP_AES_256                     r_rsip_wrapper_p6f_aes256
    #define RSIP_PRV_FUNC_INIT_KEY_WRAP_AES_256                r_rsip_p6e_aes256
    #define RSIP_PRV_FUNC_KEY_WRAP_AES_256_KUK                 r_rsip_p6e_aes256_KUK
    #define RSIP_PRV_FUNC_RFC3394_AES_256_KEY_WRAP             r_rsip_wrapper_p8f_aes256
    #define RSIP_PRV_FUNC_RFC3394_AES_256_KEY_UNWRAP           r_rsip_wrapper_p90_aes256
    #if RSIP_CFG_AES_ECB_CBC_CTR_ENABLE
        #define RSIP_PRV_FUNC_AES_CIPHER_INIT_ECB_ENC_256         r_rsip_wrapper_p50i_aes256ecb_encrypt
        #define RSIP_PRV_FUNC_AES_CIPHER_INIT_ECB_DEC_256         r_rsip_wrapper_p50i_aes256ecb_decrypt
        #define RSIP_PRV_FUNC_AES_CIPHER_INIT_CBC_ENC_256         r_rsip_wrapper_p50i_aes256cbc_encrypt
        #define RSIP_PRV_FUNC_AES_CIPHER_INIT_CBC_DEC_256         r_rsip_wrapper_p50i_aes256cbc_decrypt
        #define RSIP_PRV_FUNC_AES_CIPHER_INIT_CTR_256             r_rsip_wrapper_p50i_aes256ctr_crypt
        #define RSIP_PRV_FUNC_AES_CIPHER_UPDATE_256               r_rsip_p50u
        #define RSIP_PRV_FUNC_AES_CIPHER_FINAL_256                r_rsip_p50f
    #else
        #define RSIP_PRV_FUNC_AES_CIPHER_INIT_ECB_ENC_256         NULL
        #define RSIP_PRV_FUNC_AES_CIPHER_INIT_ECB_DEC_256         NULL
        #define RSIP_PRV_FUNC_AES_CIPHER_INIT_CBC_ENC_256         NULL
        #define RSIP_PRV_FUNC_AES_CIPHER_INIT_CBC_DEC_256         NULL
        #define RSIP_PRV_FUNC_AES_CIPHER_INIT_CTR_256             NULL
        #define RSIP_PRV_FUNC_AES_CIPHER_UPDATE_256               NULL
        #define RSIP_PRV_FUNC_AES_CIPHER_FINAL_256                NULL
    #endif
#else
    #define RSIP_PRV_FUNC_KEY_GENERATE_AES_256                 NULL
    #define RSIP_PRV_FUNC_KEY_WRAP_AES_256                     NULL
    #define RSIP_PRV_FUNC_INIT_KEY_WRAP_AES_256                NULL
    #define RSIP_PRV_FUNC_KEY_WRAP_AES_256_KUK                 NULL
    #define RSIP_PRV_FUNC_RFC3394_AES_256_KEY_WRAP             NULL
    #define RSIP_PRV_FUNC_RFC3394_AES_256_KEY_UNWRAP           NULL
    #define RSIP_PRV_FUNC_AES_CIPHER_INIT_ECB_ENC_256          NULL
    #define RSIP_PRV_FUNC_AES_CIPHER_INIT_ECB_DEC_256          NULL
    #define RSIP_PRV_FUNC_AES_CIPHER_INIT_CBC_ENC_256          NULL
    #define RSIP_PRV_FUNC_AES_CIPHER_INIT_CBC_DEC_256          NULL
    #define RSIP_PRV_FUNC_AES_CIPHER_INIT_CTR_256              NULL
    #define RSIP_PRV_FUNC_AES_CIPHER_UPDATE_256                NULL
    #define RSIP_PRV_FUNC_AES_CIPHER_FINAL_256                 NULL
#endif
#if RSIP_CFG_AES_GCM_ENABLE
    #define RSIP_PRV_FUNC_AES_GCM_ENC_INIT_256                 r_rsip_wrapper_p34i_aes256gcm_encrypt
    #define RSIP_PRV_FUNC_AES_GCM_ENC_UPDATE_AAD_256           r_rsip_p34a
    #define RSIP_PRV_FUNC_AES_GCM_ENC_UPDATE_TRANSITION_256    r_rsip_p34t
    #define RSIP_PRV_FUNC_AES_GCM_ENC_UPDATE_256               r_rsip_p34u
    #define RSIP_PRV_FUNC_AES_GCM_ENC_FINAL_256                r_rsip_p34f
    #define RSIP_PRV_FUNC_AES_GCM_DEC_INIT_256                 r_rsip_wrapper_p36i_aes256gcm_decrypt
    #define RSIP_PRV_FUNC_AES_GCM_DEC_UPDATE_AAD_256           r_rsip_p36a
    #define RSIP_PRV_FUNC_AES_GCM_DEC_UPDATE_TRANSITION_256    r_rsip_p36t
    #define RSIP_PRV_FUNC_AES_GCM_DEC_UPDATE_256               r_rsip_p36u
    #define RSIP_PRV_FUNC_AES_GCM_DEC_FINAL_256                r_rsip_p36f
#else
    #define RSIP_PRV_FUNC_AES_GCM_ENC_INIT_256                 NULL
    #define RSIP_PRV_FUNC_AES_GCM_ENC_UPDATE_AAD_256           NULL
    #define RSIP_PRV_FUNC_AES_GCM_ENC_UPDATE_TRANSITION_256    NULL
    #define RSIP_PRV_FUNC_AES_GCM_ENC_UPDATE_256               NULL
    #define RSIP_PRV_FUNC_AES_GCM_ENC_FINAL_256                NULL
    #define RSIP_PRV_FUNC_AES_GCM_DEC_INIT_256                 NULL
    #define RSIP_PRV_FUNC_AES_GCM_DEC_UPDATE_AAD_256           NULL
    #define RSIP_PRV_FUNC_AES_GCM_DEC_UPDATE_TRANSITION_256    NULL
    #define RSIP_PRV_FUNC_AES_GCM_DEC_UPDATE_256               NULL
    #define RSIP_PRV_FUNC_AES_GCM_DEC_FINAL_256                NULL
#endif
#if RSIP_CFG_AES_CCM_ENABLE
    #define RSIP_PRV_FUNC_AES_CCM_ENC_INIT_256                 r_rsip_wrapper_pa1i_aes256ccm_encrypt
    #define RSIP_PRV_FUNC_AES_CCM_ENC_UPDATE_256               r_rsip_pa1u
    #define RSIP_PRV_FUNC_AES_CCM_ENC_FINAL_256                r_rsip_pa1f
    #define RSIP_PRV_FUNC_AES_CCM_DEC_INIT_256                 r_rsip_wrapper_pa4i_aes256ccm_decrypt
    #define RSIP_PRV_FUNC_AES_CCM_DEC_UPDATE_256               r_rsip_pa4u
    #define RSIP_PRV_FUNC_AES_CCM_DEC_FINAL_256                r_rsip_pa4f
#else
    #define RSIP_PRV_FUNC_AES_CCM_ENC_INIT_256                 NULL
    #define RSIP_PRV_FUNC_AES_CCM_ENC_UPDATE_256               NULL
    #define RSIP_PRV_FUNC_AES_CCM_ENC_FINAL_256                NULL
    #define RSIP_PRV_FUNC_AES_CCM_DEC_INIT_256                 NULL
    #define RSIP_PRV_FUNC_AES_CCM_DEC_UPDATE_256               NULL
    #define RSIP_PRV_FUNC_AES_CCM_DEC_FINAL_256                NULL
#endif
#if RSIP_CFG_AES_CMAC_ENABLE
    #define RSIP_PRV_FUNC_AES_MAC_INIT_256                     r_rsip_wrapper_p44i_aes256mac
    #define RSIP_PRV_FUNC_AES_MAC_UPDATE_256                   r_rsip_p44u
    #define RSIP_PRV_FUNC_AES_MAC_GENERATE_FINAL_256           r_rsip_wrapper_p44f_aes256mac_generate
    #define RSIP_PRV_FUNC_AES_MAC_VERIFY_FINAL_256             r_rsip_wrapper_p44f_aes256mac_verify
#else
    #define RSIP_PRV_FUNC_AES_MAC_INIT_256                     NULL
    #define RSIP_PRV_FUNC_AES_MAC_UPDATE_256                   NULL
    #define RSIP_PRV_FUNC_AES_MAC_GENERATE_FINAL_256           NULL
    #define RSIP_PRV_FUNC_AES_MAC_VERIFY_FINAL_256             NULL
#endif

#if RSIP_CFG_ECC_SECP256R1_ENABLE
    #define RSIP_PRV_FUNC_KEY_PAIR_GENERATE_ECC_SECP256R1       r_rsip_wrapper_pf4_secp256r1
    #define RSIP_PRV_FUNC_KEY_PAIR_GENERATE_ECC_BRAINPOOLP256R1 r_rsip_wrapper_pf4_brainpoolp256r1
    #define RSIP_PRV_FUNC_KEY_PAIR_GENERATE_ECC_SECP256K1       r_rsip_wrapper_pf4_secp256k1
    #define RSIP_PRV_FUNC_KEY_WRAP_ECC_SECP256R1_PUBLIC         r_rsip_wrapper_p6f_secp256r1_pub
    #define RSIP_PRV_FUNC_KEY_WRAP_ECC_SECP256R1_PRIVATE        r_rsip_wrapper_p6f_secp256r1_priv
    #define RSIP_PRV_FUNC_KEY_WRAP_ECC_BRAINPOOLP256R1_PUBLIC   r_rsip_wrapper_p6f_brainpoolp256r1_pub
    #define RSIP_PRV_FUNC_KEY_WRAP_ECC_BRAINPOOLP256R1_PRIVATE  r_rsip_wrapper_p6f_brainpoolp256r1_priv
    #define RSIP_PRV_FUNC_KEY_WRAP_ECC_SECP256K1_PUBLIC         r_rsip_wrapper_p6f_secp256k1_pub
    #define RSIP_PRV_FUNC_KEY_WRAP_ECC_SECP256K1_PRIVATE        r_rsip_wrapper_p6f_secp256k1_priv

