renesas/rx-driver-package/source/r_rsip_protected_rx/r_rsip_protected_rx_vx.xx/r_rsip_protected_rx/src/private/rx261/r_rsip_private.c
    #define RSIP_PRV_FUNC_INIT_KEY_WRAP_ECC_P256_PUBLIC         r_rsip_p6e_eccp256_public
    #define RSIP_PRV_FUNC_INIT_KEY_WRAP_ECC_P256_PRIVATE        r_rsip_p6e_eccp256_private
    #define RSIP_PRV_FUNC_INIT_KEY_WRAP_ECC_P256R1_PUBLIC       r_rsip_p6e_eccp256r1_public
    #define RSIP_PRV_FUNC_INIT_KEY_WRAP_ECC_P256R1_PRIVATE      r_rsip_p6e_eccp256r1_private
    #define RSIP_PRV_FUNC_INIT_KEY_WRAP_ECC_SECP256K1_PUBLIC    r_rsip_p6e_eccsecp256k1_public
    #define RSIP_PRV_FUNC_INIT_KEY_WRAP_ECC_SECP256K1_PRIVATE   r_rsip_p6e_eccsecp256k1_private
    #define RSIP_PRV_FUNC_ECDSA_SIGN_SECP256R1                  r_rsip_wrapper_pf0_secp256r1
    #define RSIP_PRV_FUNC_ECDSA_SIGN_BRAINPOOLP256R1            r_rsip_wrapper_pf0_brainpoolp256r1
    #define RSIP_PRV_FUNC_ECDSA_SIGN_SECP256K1                  r_rsip_wrapper_pf0_secp256k1
    #define RSIP_PRV_FUNC_ECDSA_VERIFY_SECP256R1                r_rsip_wrapper_pf1_secp256r1
    #define RSIP_PRV_FUNC_ECDSA_VERIFY_BRAINPOOLP256R1          r_rsip_wrapper_pf1_brainpoolp256r1
    #define RSIP_PRV_FUNC_ECDSA_VERIFY_SECP256K1                r_rsip_wrapper_pf1_secp256k1
#else
    #define RSIP_PRV_FUNC_KEY_PAIR_GENERATE_ECC_SECP256R1       NULL
    #define RSIP_PRV_FUNC_KEY_PAIR_GENERATE_ECC_BRAINPOOLP256R1 NULL
    #define RSIP_PRV_FUNC_KEY_PAIR_GENERATE_ECC_SECP256K1       NULL
    #define RSIP_PRV_FUNC_KEY_WRAP_ECC_SECP256R1_PUBLIC         NULL
    #define RSIP_PRV_FUNC_KEY_WRAP_ECC_SECP256R1_PRIVATE        NULL
    #define RSIP_PRV_FUNC_KEY_WRAP_ECC_BRAINPOOLP256R1_PUBLIC   NULL
    #define RSIP_PRV_FUNC_KEY_WRAP_ECC_BRAINPOOLP256R1_PRIVATE  NULL
    #define RSIP_PRV_FUNC_KEY_WRAP_ECC_SECP256K1_PUBLIC         NULL
    #define RSIP_PRV_FUNC_KEY_WRAP_ECC_SECP256K1_PRIVATE        NULL

    #define RSIP_PRV_FUNC_INIT_KEY_WRAP_ECC_P256_PUBLIC         NULL
    #define RSIP_PRV_FUNC_INIT_KEY_WRAP_ECC_P256_PRIVATE        NULL
    #define RSIP_PRV_FUNC_INIT_KEY_WRAP_ECC_P256R1_PUBLIC       NULL
    #define RSIP_PRV_FUNC_INIT_KEY_WRAP_ECC_P256R1_PRIVATE      NULL
    #define RSIP_PRV_FUNC_INIT_KEY_WRAP_ECC_SECP256K1_PUBLIC    NULL
    #define RSIP_PRV_FUNC_INIT_KEY_WRAP_ECC_SECP256K1_PRIVATE   NULL
    #define RSIP_PRV_FUNC_ECDSA_SIGN_SECP256R1                  NULL
    #define RSIP_PRV_FUNC_ECDSA_SIGN_BRAINPOOLP256R1            NULL
    #define RSIP_PRV_FUNC_ECDSA_SIGN_SECP256K1                  NULL
    #define RSIP_PRV_FUNC_ECDSA_VERIFY_SECP256R1                NULL
    #define RSIP_PRV_FUNC_ECDSA_VERIFY_BRAINPOOLP256R1          NULL
    #define RSIP_PRV_FUNC_ECDSA_VERIFY_SECP256K1                NULL
#endif

#if RSIP_CFG_HMAC_SHA224_ENABLE
    #define RSIP_PRV_FUNC_KEY_GENERATE_HMAC_SHA224             r_rsip_p0a
    #define RSIP_PRV_FUNC_KEY_WRAP_HMAC_SHA224                 r_rsip_wrapper_p6f_hmacsha224
    #define RSIP_PRV_FUNC_INIT_KEY_WRAP_HMAC_SHA224            r_rsip_p6e_hmacsha224
#else
    #define RSIP_PRV_FUNC_KEY_GENERATE_HMAC_SHA224             NULL
    #define RSIP_PRV_FUNC_KEY_WRAP_HMAC_SHA224                 NULL
    #define RSIP_PRV_FUNC_INIT_KEY_WRAP_HMAC_SHA224            NULL
#endif

#if RSIP_CFG_HMAC_SHA256_ENABLE
    #define RSIP_PRV_FUNC_KEY_GENERATE_HMAC_SHA256             r_rsip_p0b
    #define RSIP_PRV_FUNC_KEY_WRAP_HMAC_SHA256                 r_rsip_wrapper_p6f_hmacsha256
    #define RSIP_PRV_FUNC_INIT_KEY_WRAP_HMAC_SHA256            r_rsip_p6e_hmacsha256
#else
    #define RSIP_PRV_FUNC_KEY_GENERATE_HMAC_SHA256             NULL
    #define RSIP_PRV_FUNC_KEY_WRAP_HMAC_SHA256                 NULL
    #define RSIP_PRV_FUNC_INIT_KEY_WRAP_HMAC_SHA256            NULL
#endif

#if RSIP_CFG_FIRMWARE_UPDATE_ENABLE
    #define RSIP_PRV_FUNC_FIRMWARE_UPDATE_INIT                  r_rsip_p23i
    #define RSIP_PRV_FUNC_FIRMWARE_UPDATE_UPDATE                r_rsip_p23u
    #define RSIP_PRV_FUNC_FIRMWARE_UPDATE_FINAL                 r_rsip_p23f
#else
    #define RSIP_PRV_FUNC_FIRMWARE_UPDATE_INIT                  NULL
    #define RSIP_PRV_FUNC_FIRMWARE_UPDATE_UPDATE                NULL
    #define RSIP_PRV_FUNC_FIRMWARE_UPDATE_FINAL                 NULL
#endif

#if RSIP_CFG_SECURE_BOOT_ENABLE
    #define RSIP_PRV_FUNC_SECURE_BOOT_INIT                  r_rsip_p26i
    #define RSIP_PRV_FUNC_SECURE_BOOT_UPDATE                r_rsip_p26u
    #define RSIP_PRV_FUNC_SECURE_BOOT_FINAL                 r_rsip_p26f
#else
    #define RSIP_PRV_FUNC_SECURE_BOOT_INIT                  NULL
    #define RSIP_PRV_FUNC_SECURE_BOOT_UPDATE                NULL
    #define RSIP_PRV_FUNC_SECURE_BOOT_FINAL                 NULL
#endif

#define RSIP_PRV_FUNC_RANDOM_NUMBER_GENERATE                r_rsip_p20
#define RSIP_PRV_FUNC_GHASH_COMPUTE                         r_rsip_p21

/* Block length (in bytes) of SHA */
#define SHA_BLOCK8_LEN          (64u)
#define HMAC_LAST_BLOCK_ADD_LEN (64u)
#define SHA_STOP_BIT            (0x80)

/***********************************************************************************************************************
 * Typedef definitions
 **********************************************************************************************************************/
typedef enum e_rsip_hmac_cmd
{
    RSIP_HMAC_CMD_SIGN   = 0U,
    RSIP_HMAC_CMD_VERIFY = 1U,
} rsip_hmac_cmd_t;

/***********************************************************************************************************************
 * Private function prototypes
 **********************************************************************************************************************/
static void set_sha2_final_block (uint8_t * p_message, uint32_t message_length, uint32_t total_message_length,
        uint8_t * p_last_block, uint32_t * p_last_block_length);

/***********************************************************************************************************************
 * Private global variables
 **********************************************************************************************************************/
uint32_t const * S_INST2;
uint32_t INST_DATA_SIZE;
uint32_t KEY_INDEX_SIZE;
uint32_t WRAPPED_KEY_SIZE;

const bool g_sha_enabled[RSIP_HASH_TYPE_NUM] =
{
    [RSIP_HASH_TYPE_SHA224] = RSIP_CFG_SHA224_ENABLE,
    [RSIP_HASH_TYPE_SHA256] = RSIP_CFG_SHA256_ENABLE,
};

