renesas/rx-driver-package/source/r_rsip_protected_rx/r_rsip_protected_rx_vx.xx/r_rsip_protected_rx/src/private/rx261/r_rsip_private.c
RSIP_SEC_C_SECURE_BOOT
static const rsip_func_initial_key_wrap_t gsp_func_initial_key_wrap_aes[RSIP_KEY_AES_NUM] =
{
    [RSIP_KEY_AES_128] = RSIP_PRV_FUNC_INIT_KEY_WRAP_AES_128,
    [RSIP_KEY_AES_256] = RSIP_PRV_FUNC_INIT_KEY_WRAP_AES_256
};
RSIP_SEC_DEFAULT

static const rsip_func_initial_key_wrap_t gsp_func_initial_key_wrap_ecc_pub[RSIP_KEY_ECC_NUM] =
{
    [RSIP_KEY_ECC_SECP256R1] = RSIP_PRV_FUNC_INIT_KEY_WRAP_ECC_P256_PUBLIC,
    [RSIP_KEY_ECC_SECP256K1] = RSIP_PRV_FUNC_INIT_KEY_WRAP_ECC_SECP256K1_PUBLIC,
    [RSIP_KEY_ECC_BRAINPOOLP256R1] = RSIP_PRV_FUNC_INIT_KEY_WRAP_ECC_P256R1_PUBLIC
};

static const rsip_func_initial_key_wrap_t gsp_func_initial_key_wrap_ecc_priv[RSIP_KEY_ECC_NUM] =
{
    [RSIP_KEY_ECC_SECP256R1] = RSIP_PRV_FUNC_INIT_KEY_WRAP_ECC_P256_PRIVATE,
    [RSIP_KEY_ECC_SECP256K1] = RSIP_PRV_FUNC_INIT_KEY_WRAP_ECC_SECP256K1_PRIVATE,
    [RSIP_KEY_ECC_BRAINPOOLP256R1] = RSIP_PRV_FUNC_INIT_KEY_WRAP_ECC_P256R1_PRIVATE
};

static const rsip_func_initial_key_wrap_t gsp_func_initial_key_wrap_hmac[RSIP_KEY_HMAC_NUM] =
{
    [RSIP_KEY_HMAC_SHA224] = RSIP_PRV_FUNC_INIT_KEY_WRAP_HMAC_SHA224,
    [RSIP_KEY_HMAC_SHA256] = RSIP_PRV_FUNC_INIT_KEY_WRAP_HMAC_SHA256
};

static const uint32_t gs_hmac_cmd[] =
{
    [RSIP_HMAC_CMD_SIGN]   = BSWAP_32BIG_C(0U),
    [RSIP_HMAC_CMD_VERIFY] = BSWAP_32BIG_C(1U),
};

/***********************************************************************************************************************
 * Global variables
 **********************************************************************************************************************/
const bool g_hmac_enabled[RSIP_KEY_HMAC_NUM] =
{
    [RSIP_KEY_HMAC_SHA224] = RSIP_CFG_HMAC_SHA224_ENABLE,
    [RSIP_KEY_HMAC_SHA256] = RSIP_CFG_HMAC_SHA256_ENABLE
};

RSIP_SEC_C_SECURE_BOOT
const rsip_func_t g_func =
{
    .p_key_generate_aes            =
    {
        [RSIP_KEY_AES_128] = RSIP_PRV_FUNC_KEY_GENERATE_AES_128,
        [RSIP_KEY_AES_256] = RSIP_PRV_FUNC_KEY_GENERATE_AES_256
    },
    .p_key_generate_hmac           =
    {
        [RSIP_KEY_HMAC_SHA224] = RSIP_PRV_FUNC_KEY_GENERATE_HMAC_SHA224,
        [RSIP_KEY_HMAC_SHA256] = RSIP_PRV_FUNC_KEY_GENERATE_HMAC_SHA256
    },
    .p_key_pair_generate_ecc       =
    {
        [RSIP_KEY_ECC_SECP256R1] = RSIP_PRV_FUNC_KEY_PAIR_GENERATE_ECC_SECP256R1,
        [RSIP_KEY_ECC_BRAINPOOLP256R1] = RSIP_PRV_FUNC_KEY_PAIR_GENERATE_ECC_BRAINPOOLP256R1,
        [RSIP_KEY_ECC_SECP256K1] = RSIP_PRV_FUNC_KEY_PAIR_GENERATE_ECC_SECP256K1,
    },
    .p_encrypted_key_wrap_aes     =
    {
        [RSIP_KEY_AES_128] = RSIP_PRV_FUNC_KEY_WRAP_AES_128,
        [RSIP_KEY_AES_256] = RSIP_PRV_FUNC_KEY_WRAP_AES_256
    },
    .p_initial_key_update_key_wrap_aes      =
    {
        RSIP_PRV_FUNC_KEY_WRAP_AES_256_KUK
    },
    .p_encrypted_key_wrap_ecc_pub  =
    {
        [RSIP_KEY_ECC_SECP256R1] = RSIP_PRV_FUNC_KEY_WRAP_ECC_SECP256R1_PUBLIC,
        [RSIP_KEY_ECC_BRAINPOOLP256R1] = RSIP_PRV_FUNC_KEY_WRAP_ECC_BRAINPOOLP256R1_PUBLIC,
        [RSIP_KEY_ECC_SECP256K1] = RSIP_PRV_FUNC_KEY_WRAP_ECC_SECP256K1_PUBLIC,
    },
    .p_encrypted_key_wrap_ecc_priv =
    {
        [RSIP_KEY_ECC_SECP256R1] = RSIP_PRV_FUNC_KEY_WRAP_ECC_SECP256R1_PRIVATE,
        [RSIP_KEY_ECC_BRAINPOOLP256R1] = RSIP_PRV_FUNC_KEY_WRAP_ECC_BRAINPOOLP256R1_PRIVATE,
        [RSIP_KEY_ECC_SECP256K1] = RSIP_PRV_FUNC_KEY_WRAP_ECC_SECP256K1_PRIVATE,
    },
    .p_rfc3394_key_wrap            =
    {
        [RSIP_KEY_AES_128] = RSIP_PRV_FUNC_RFC3394_AES_128_KEY_WRAP,
        [RSIP_KEY_AES_256] = RSIP_PRV_FUNC_RFC3394_AES_256_KEY_WRAP
    },
    .p_rfc3394_key_unwrap          =
    {
        [RSIP_KEY_AES_128] = RSIP_PRV_FUNC_RFC3394_AES_128_KEY_UNWRAP,
        [RSIP_KEY_AES_256] = RSIP_PRV_FUNC_RFC3394_AES_256_KEY_UNWRAP
    },
    .p_aes_cipher                  =
    {
        [RSIP_KEY_AES_128] =
        {
            .p_init_ecb_enc = RSIP_PRV_FUNC_AES_CIPHER_INIT_ECB_ENC_128,
            .p_init_ecb_dec = RSIP_PRV_FUNC_AES_CIPHER_INIT_ECB_DEC_128,
            .p_init_cbc_enc = RSIP_PRV_FUNC_AES_CIPHER_INIT_CBC_ENC_128,
            .p_init_cbc_dec = RSIP_PRV_FUNC_AES_CIPHER_INIT_CBC_DEC_128,
            .p_init_ctr = RSIP_PRV_FUNC_AES_CIPHER_INIT_CTR_128,
            .p_update = RSIP_PRV_FUNC_AES_CIPHER_UPDATE_128,
            .p_final = RSIP_PRV_FUNC_AES_CIPHER_FINAL_128,
        },
        [RSIP_KEY_AES_256] =
        {
            .p_init_ecb_enc = RSIP_PRV_FUNC_AES_CIPHER_INIT_ECB_ENC_256,
            .p_init_ecb_dec = RSIP_PRV_FUNC_AES_CIPHER_INIT_ECB_DEC_256,
            .p_init_cbc_enc = RSIP_PRV_FUNC_AES_CIPHER_INIT_CBC_ENC_256,
            .p_init_cbc_dec = RSIP_PRV_FUNC_AES_CIPHER_INIT_CBC_DEC_256,
            .p_init_ctr = RSIP_PRV_FUNC_AES_CIPHER_INIT_CTR_256,
            .p_update = RSIP_PRV_FUNC_AES_CIPHER_UPDATE_256,
            .p_final = RSIP_PRV_FUNC_AES_CIPHER_FINAL_256,
        }
    },
    .p_aes_gcm_enc =
        {
        [RSIP_KEY_AES_128] =
        {
            .p_init = RSIP_PRV_FUNC_AES_GCM_ENC_INIT_128,
            .p_updateAad = RSIP_PRV_FUNC_AES_GCM_ENC_UPDATE_AAD_128,
            .p_updateTransition = RSIP_PRV_FUNC_AES_GCM_ENC_UPDATE_TRANSITION_128,
            .p_update = RSIP_PRV_FUNC_AES_GCM_ENC_UPDATE_128,
            .p_encryptFinal = RSIP_PRV_FUNC_AES_GCM_ENC_FINAL_128
        },
        [RSIP_KEY_AES_256] =
        {
            .p_init = RSIP_PRV_FUNC_AES_GCM_ENC_INIT_256,
            .p_updateAad = RSIP_PRV_FUNC_AES_GCM_ENC_UPDATE_AAD_256,
            .p_updateTransition = RSIP_PRV_FUNC_AES_GCM_ENC_UPDATE_TRANSITION_256,
            .p_update = RSIP_PRV_FUNC_AES_GCM_ENC_UPDATE_256,
            .p_encryptFinal = RSIP_PRV_FUNC_AES_GCM_ENC_FINAL_256
        }
    },
    .p_aes_gcm_dec =
    {
        [RSIP_KEY_AES_128] =
        {
            .p_init = RSIP_PRV_FUNC_AES_GCM_DEC_INIT_128,
            .p_updateAad = RSIP_PRV_FUNC_AES_GCM_DEC_UPDATE_AAD_128,
            .p_updateTransition = RSIP_PRV_FUNC_AES_GCM_DEC_UPDATE_TRANSITION_128,
            .p_update = RSIP_PRV_FUNC_AES_GCM_DEC_UPDATE_128,
            .p_decryptFinal = RSIP_PRV_FUNC_AES_GCM_DEC_FINAL_128
        },
        [RSIP_KEY_AES_256] =
        {
            .p_init = RSIP_PRV_FUNC_AES_GCM_DEC_INIT_256,
            .p_updateAad = RSIP_PRV_FUNC_AES_GCM_DEC_UPDATE_AAD_256,
            .p_updateTransition = RSIP_PRV_FUNC_AES_GCM_DEC_UPDATE_TRANSITION_256,
            .p_update = RSIP_PRV_FUNC_AES_GCM_DEC_UPDATE_256,
            .p_decryptFinal = RSIP_PRV_FUNC_AES_GCM_DEC_FINAL_256
        }
    },
    .p_aes_ccm_enc =
    {
        [RSIP_KEY_AES_128] =
        {
            .p_encryptInit = RSIP_PRV_FUNC_AES_CCM_ENC_INIT_128,
            .p_update = RSIP_PRV_FUNC_AES_CCM_ENC_UPDATE_128,
            .p_encryptFinal = RSIP_PRV_FUNC_AES_CCM_ENC_FINAL_128
        },
        [RSIP_KEY_AES_256] =
        {
            .p_encryptInit = RSIP_PRV_FUNC_AES_CCM_ENC_INIT_256,
            .p_update = RSIP_PRV_FUNC_AES_CCM_ENC_UPDATE_256,
            .p_encryptFinal = RSIP_PRV_FUNC_AES_CCM_ENC_FINAL_256
        }
    },
    .p_aes_ccm_dec =
    {
        [RSIP_KEY_AES_128] =
        {
            .p_decryptInit = RSIP_PRV_FUNC_AES_CCM_DEC_INIT_128,
            .p_update = RSIP_PRV_FUNC_AES_CCM_DEC_UPDATE_128,
            .p_decryptFinal = RSIP_PRV_FUNC_AES_CCM_DEC_FINAL_128
        },
        [RSIP_KEY_AES_256] =
        {
            .p_decryptInit = RSIP_PRV_FUNC_AES_CCM_DEC_INIT_256,
            .p_update = RSIP_PRV_FUNC_AES_CCM_DEC_UPDATE_256,
            .p_decryptFinal = RSIP_PRV_FUNC_AES_CCM_DEC_FINAL_256
        }
    },
    .p_aes_mac =
    {
        [RSIP_KEY_AES_128] =
        {
            .p_init = RSIP_PRV_FUNC_AES_MAC_INIT_128,
            .p_update = RSIP_PRV_FUNC_AES_MAC_UPDATE_128,
            .p_generateFinal = RSIP_PRV_FUNC_AES_MAC_GENERATE_FINAL_128,
            .p_verifyFinal = RSIP_PRV_FUNC_AES_MAC_VERIFY_FINAL_128
        },
        [RSIP_KEY_AES_256] =
        {
            .p_init = RSIP_PRV_FUNC_AES_MAC_INIT_256,
            .p_update = RSIP_PRV_FUNC_AES_MAC_UPDATE_256,
            .p_generateFinal = RSIP_PRV_FUNC_AES_MAC_GENERATE_FINAL_256,
            .p_verifyFinal = RSIP_PRV_FUNC_AES_MAC_VERIFY_FINAL_256
        }
    },
    .p_ecdsa_sign =
    {
        [RSIP_KEY_ECC_SECP256R1] = RSIP_PRV_FUNC_ECDSA_SIGN_SECP256R1,
        [RSIP_KEY_ECC_BRAINPOOLP256R1] = RSIP_PRV_FUNC_ECDSA_SIGN_BRAINPOOLP256R1,
        [RSIP_KEY_ECC_SECP256K1] = RSIP_PRV_FUNC_ECDSA_SIGN_SECP256K1
    },
    .p_ecdsa_verify =
    {
        [RSIP_KEY_ECC_SECP256R1] = RSIP_PRV_FUNC_ECDSA_VERIFY_SECP256R1,
        [RSIP_KEY_ECC_BRAINPOOLP256R1] = RSIP_PRV_FUNC_ECDSA_VERIFY_BRAINPOOLP256R1,
        [RSIP_KEY_ECC_SECP256K1] = RSIP_PRV_FUNC_ECDSA_VERIFY_SECP256K1
    },
    .p_encrypted_key_wrap_hmac =
    {
        [RSIP_KEY_HMAC_SHA224] = RSIP_PRV_FUNC_KEY_WRAP_HMAC_SHA224,
        [RSIP_KEY_HMAC_SHA256] = RSIP_PRV_FUNC_KEY_WRAP_HMAC_SHA256
    },
    .p_rng           = RSIP_PRV_FUNC_RANDOM_NUMBER_GENERATE,
    .p_ghash_compute = RSIP_PRV_FUNC_GHASH_COMPUTE,
    .p_fwup =
    {
        .p_init          = RSIP_PRV_FUNC_FIRMWARE_UPDATE_INIT,
        .p_update        = RSIP_PRV_FUNC_FIRMWARE_UPDATE_UPDATE,
        .p_final         = RSIP_PRV_FUNC_FIRMWARE_UPDATE_FINAL,
    },
    .p_sb =
    {
        .p_init          = RSIP_PRV_FUNC_SECURE_BOOT_INIT,
        .p_update        = RSIP_PRV_FUNC_SECURE_BOOT_UPDATE,
        .p_final         = RSIP_PRV_FUNC_SECURE_BOOT_FINAL,
    },
};
RSIP_SEC_DEFAULT
/***********************************************************************************************************************
 * Functions
 **********************************************************************************************************************/
RSIP_SEC_P_SECURE_BOOT
rsip_err_t r_rsip_open(void)
{
    uint32_t indata_lc = RSIP_DUMMY_LC;
    rsip_err_t rsip_ret = RSIP_ERR_FAIL;

    R_BSP_RegisterProtectDisable(BSP_REG_PROTECT_LPC_CGC_SWR);

