renesas/rx-driver-package/source/r_rsip_protected_rx/r_rsip_protected_rx_vx.xx/r_rsip_protected_rx/src/private/rx261/r_rsip_private.c
    /* Casting structure pointer is used for address. */
    MSTP_SECURITY = 0U;
    R_BSP_RegisterProtectEnable(BSP_REG_PROTECT_LPC_CGC_SWR);

    r_rsip_p00();

    rsip_ret = r_rsip_p81();

    if (RSIP_SUCCESS == rsip_ret)
    {
#if defined __LIT
        RSIP.REG_0018H.WORD = 0x006b006bU;
        RSIP.REG_001CH.WORD = 0x00eb00ebU;
#else
        RSIP.REG_0018H.WORD = R_BSP_REVL(0x006b006bU);
        RSIP.REG_001CH.WORD = R_BSP_REVL(0x00eb00ebU);
#endif  /* defined __LIT */
        rsip_ret = r_rsip_p82();
        if (RSIP_ERR_RETRY == rsip_ret)
        {
            rsip_ret = r_rsip_p82();
            if (RSIP_ERR_RETRY == rsip_ret)
            {
                rsip_ret = r_rsip_p82();
            }
        }
    }

    if (RSIP_SUCCESS == rsip_ret)
    {
        rsip_ret = r_rsip_p40(&indata_lc);
    }

    return rsip_ret;
}

RSIP_SEC_P_SECURE_BOOT
rsip_err_t r_rsip_close(void)
{
    r_rsip_p00();

    R_BSP_RegisterProtectDisable(BSP_REG_PROTECT_LPC_CGC_SWR);

    /* Casting structure pointer is used for address. */
    MSTP_SECURITY = 1U;
    R_BSP_RegisterProtectEnable(BSP_REG_PROTECT_LPC_CGC_SWR);

    return RSIP_SUCCESS;
}

RSIP_SEC_P_SECURE_BOOT
rsip_err_t r_rsip_fwup_start(void)
{
    rsip_err_t rsip_ret = r_rsip_p22();

    return rsip_ret;
}
RSIP_SEC_DEFAULT
/***********************************************************************************************************************
 * Set KUK to S_INT2.
 *
 * @param[in] p_key_update_key_value KUK value.
 *
 * @return void.
 **********************************************************************************************************************/
void r_rsip_kuk_set(const uint8_t * p_key_update_key_value)
{
    S_INST2 = (uint32_t *) p_key_update_key_value;
}

/*******************************************************************************************************************//**
 * prepares to execute the SHA256 hash operation
 *
 * @param handle SHA256 handler (work area)
 *
 * @retval FSP_SUCCESS Normal termination.
 **********************************************************************************************************************/
rsip_err_t r_rsip_sha256initprivate(rsip_sha_handle_t * handle)
{
    uint32_t indata_sha256initval[8] =
    {
        0
    };

    FSP_PARAMETER_NOT_USED(handle);

    indata_sha256initval[0] = change_endian_long(0x6a09e667);
    indata_sha256initval[1] = change_endian_long(0xbb67ae85);
    indata_sha256initval[2] = change_endian_long(0x3c6ef372);
    indata_sha256initval[3] = change_endian_long(0xa54ff53a);
    indata_sha256initval[4] = change_endian_long(0x510e527f);
    indata_sha256initval[5] = change_endian_long(0x9b05688c);
    indata_sha256initval[6] = change_endian_long(0x1f83d9ab);
    indata_sha256initval[7] = change_endian_long(0x5be0cd19);

    memcpy(handle->current_hash, indata_sha256initval, RSIP_PRV_SHA224256_HASH_LENGTH_BYTE_SIZE);

    return RSIP_SUCCESS;
}

/*******************************************************************************************************************//**
 * prepares to execute the SHA256 hash operation
 *
 * @param handle SHA256 handler (work area)
 *
 * @retval FSP_SUCCESS Normal termination.
 **********************************************************************************************************************/
rsip_err_t r_rsip_sha224initprivate(rsip_sha_handle_t * handle)
{
    uint32_t indata_sha224initval[8] =
    {
        0
    };

    FSP_PARAMETER_NOT_USED(handle);

    indata_sha224initval[0] = change_endian_long(0xc1059ed8);
    indata_sha224initval[1] = change_endian_long(0x367cd507);
    indata_sha224initval[2] = change_endian_long(0x3070dd17);
    indata_sha224initval[3] = change_endian_long(0xf70e5939);
    indata_sha224initval[4] = change_endian_long(0xffc00b31);
    indata_sha224initval[5] = change_endian_long(0x68581511);
    indata_sha224initval[6] = change_endian_long(0x64f98fa7);
    indata_sha224initval[7] = change_endian_long(0xbefa4fa4);

    memcpy(handle->current_hash, indata_sha224initval, RSIP_PRV_SHA224256_HASH_LENGTH_BYTE_SIZE);

    return RSIP_SUCCESS;
}

rsip_err_t r_rsip_sha1sha2_init_update(uint8_t         * current_hash,
                                        uint8_t        * p_message,
                                        uint64_t         message_length,
                                        uint32_t       * internal_state)
{
    FSP_PARAMETER_NOT_USED(internal_state);

    return r_rsip_p72((uint32_t *) current_hash,
                        (const uint32_t *) p_message,
                        r_rsip_byte_to_word_convert((uint32_t) message_length),
                        (uint32_t*) current_hash);
}

rsip_err_t r_rsip_sha1sha2_update(uint8_t          * current_hash,
                                    uint8_t        * p_message,
                                    uint64_t         message_length,
                                    uint32_t       * internal_state)
{
    FSP_PARAMETER_NOT_USED(internal_state);

    return r_rsip_p72((uint32_t*) current_hash,
                    (const uint32_t*) p_message,
                    r_rsip_byte_to_word_convert((uint32_t) message_length),
                    (uint32_t*) current_hash);
}

rsip_err_t r_rsip_sha1sha2_init_final(uint8_t * current_hash,
                                        uint8_t * p_message,
                                        uint64_t message_length,
                                        uint8_t * p_digest)
{
    uint32_t set_prc_byte_size;
    set_sha2_final_block ((uint8_t *)p_message, message_length, message_length,
            (uint8_t *)p_message, &set_prc_byte_size);

    return r_rsip_p72((uint32_t*) current_hash,
                    (const uint32_t*) p_message,
                    r_rsip_byte_to_word_convert((uint32_t) set_prc_byte_size),
                    (uint32_t*) p_digest);
}

