renesas/rx-driver-package/source/r_rsip_protected_rx/r_rsip_protected_rx_vx.xx/r_rsip_protected_rx/src/private/rx261/r_rsip_private.c
rsip_err_t r_rsip_sha1sha2_final(uint8_t       * current_hash,
                                uint8_t        * p_message,
                                uint64_t         message_length,
                                uint64_t         total_message_length,
                                uint8_t        * p_digest,
                                uint32_t       * internal_state)
{
    FSP_PARAMETER_NOT_USED(internal_state);
    FSP_PARAMETER_NOT_USED(total_message_length);

    uint32_t set_prc_byte_size;

    set_sha2_final_block ((uint8_t *)p_message, message_length, total_message_length,
            (uint8_t *)p_message, &set_prc_byte_size);

    return r_rsip_p72((uint32_t*) current_hash,
                        (const uint32_t*) p_message,
                        r_rsip_byte_to_word_convert((uint32_t) set_prc_byte_size),
                        (uint32_t*) p_digest);
}

rsip_err_t r_rsip_hmac_init_update(const rsip_wrapped_key_t * p_wrapped_key,
                                    uint8_t                 * p_message,
                                    uint64_t                   message_length,
                                    uint32_t                 * internal_state)
{
    rsip_err_t rsip_ret = RSIP_ERR_FAIL;
    FSP_PARAMETER_NOT_USED(internal_state);

    if (RSIP_KEY_HMAC_SHA224 == p_wrapped_key->subtype)
    {
        /* Call primitive (cast to match the argument type with the primitive function) */
        rsip_ret = r_rsip_pdci((uint32_t*)p_wrapped_key->value);
    }
    else if (RSIP_KEY_HMAC_SHA256 == p_wrapped_key->subtype)
    {
        /* Call primitive (cast to match the argument type with the primitive function) */
        rsip_ret = r_rsip_p76i((uint32_t*)p_wrapped_key->value);
    }
    else
    {
        rsip_ret = RSIP_ERR_FAIL;
    }

    if (RSIP_SUCCESS == rsip_ret)
    {
        if (RSIP_KEY_HMAC_SHA224 == p_wrapped_key->subtype)
        {
            /* Call primitive (cast to match the argument type with the primitive function) */
            r_rsip_pdcu((const uint32_t*)p_message, r_rsip_byte_to_word_convert((uint32_t)message_length));
            rsip_ret = RSIP_SUCCESS;
        }
        else if (RSIP_KEY_HMAC_SHA256 == p_wrapped_key->subtype)
        {
            /* Call primitive (cast to match the argument type with the primitive function) */
            r_rsip_p76u((const uint32_t*)p_message, r_rsip_byte_to_word_convert((uint32_t)message_length));
            rsip_ret = RSIP_SUCCESS;
        }
        else
        {
            rsip_ret = RSIP_ERR_FAIL;
        }
    }

    return rsip_ret;
}

rsip_err_t r_rsip_hmac_update(const rsip_wrapped_key_t   * p_wrapped_key,
                                uint8_t                  * p_message,
                                uint64_t                   message_length,
                                uint32_t                 * internal_state)
{
    FSP_PARAMETER_NOT_USED(p_wrapped_key);
    FSP_PARAMETER_NOT_USED(internal_state);

    if (RSIP_KEY_HMAC_SHA224 == p_wrapped_key->subtype)
    {
        /* Call primitive (cast to match the argument type with the primitive function) */
        r_rsip_pdcu((const uint32_t*)p_message, r_rsip_byte_to_word_convert((uint32_t)message_length));
        return RSIP_SUCCESS;
    }
    else if (RSIP_KEY_HMAC_SHA256 == p_wrapped_key->subtype)
    {
        /* Call primitive (cast to match the argument type with the primitive function) */
        r_rsip_p76u((const uint32_t*)p_message, r_rsip_byte_to_word_convert((uint32_t)message_length));
        return RSIP_SUCCESS;
    }
    else
    {
        return RSIP_ERR_FAIL;
    }
}

rsip_err_t r_rsip_hmac_init_final(const rsip_wrapped_key_t   * p_wrapped_key,
                                    uint8_t                  * p_message,
                                    uint64_t                   message_length,
                                    uint8_t                  * p_mac)
{
    rsip_err_t rsip_ret = RSIP_ERR_FAIL;
    FSP_PARAMETER_NOT_USED(p_message);
    FSP_PARAMETER_NOT_USED(message_length);

    uint32_t set_prc_byte_size;

    if (RSIP_KEY_HMAC_SHA224 == p_wrapped_key->subtype)
    {
        /* Call primitive (cast to match the argument type with the primitive function) */
        rsip_ret = r_rsip_pdci((uint32_t*)p_wrapped_key->value);

    }
    else if (RSIP_KEY_HMAC_SHA256 == p_wrapped_key->subtype)
    {
        /* Call primitive (cast to match the argument type with the primitive function) */
        rsip_ret = r_rsip_p76i((uint32_t*)p_wrapped_key->value);

    }
    else
    {
        rsip_ret = RSIP_ERR_FAIL;
    }


    if (RSIP_SUCCESS == rsip_ret)
    {
        set_sha2_final_block ((uint8_t *)p_message, message_length, message_length + HMAC_LAST_BLOCK_ADD_LEN,
                (uint8_t *)p_message, &set_prc_byte_size);
        if (RSIP_KEY_HMAC_SHA224 == p_wrapped_key->subtype)
        {
            r_rsip_pdcu((const uint32_t*)p_message, r_rsip_byte_to_word_convert((uint32_t)set_prc_byte_size));
            /* Call primitive (cast to match the argument type with the primitive function) */
            rsip_ret = r_rsip_pdcf(&gs_hmac_cmd[RSIP_HMAC_CMD_SIGN], NULL, NULL, (uint32_t*)p_mac);

        }
        else if (RSIP_KEY_HMAC_SHA256 == p_wrapped_key->subtype)
        {
            r_rsip_p76u((const uint32_t*)p_message, r_rsip_byte_to_word_convert((uint32_t)set_prc_byte_size));
            /* Call primitive (cast to match the argument type with the primitive function) */
            rsip_ret = r_rsip_p76f(&gs_hmac_cmd[RSIP_HMAC_CMD_SIGN], NULL, NULL, (uint32_t*)p_mac);

        }
        else
        {
            rsip_ret = RSIP_ERR_FAIL;
        }
    }

    return rsip_ret;
}


rsip_err_t r_rsip_hmac_final(const rsip_wrapped_key_t    * p_wrapped_key,
                                uint8_t                  * p_message,
                                uint64_t                   message_length,
                                uint64_t                   total_message_length,
                                uint8_t                  * p_mac,
                                uint32_t                 * internal_state)
{
    rsip_err_t rsip_ret = RSIP_ERR_FAIL;
    FSP_PARAMETER_NOT_USED(p_message);
    FSP_PARAMETER_NOT_USED(message_length);
    FSP_PARAMETER_NOT_USED(total_message_length);
    FSP_PARAMETER_NOT_USED(internal_state);

    uint32_t set_prc_byte_size;

    set_sha2_final_block ((uint8_t *)p_message, message_length, total_message_length+HMAC_LAST_BLOCK_ADD_LEN,
            (uint8_t *)p_message, &set_prc_byte_size);

    if (RSIP_KEY_HMAC_SHA224 == p_wrapped_key->subtype)
    {
        r_rsip_pdcu((const uint32_t*)p_message, r_rsip_byte_to_word_convert((uint32_t)set_prc_byte_size));
        /* Call primitive (cast to match the argument type with the primitive function) */
        rsip_ret = r_rsip_pdcf(&gs_hmac_cmd[RSIP_HMAC_CMD_SIGN], NULL, NULL, (uint32_t*)p_mac);

