renesas/rx-driver-package/source/r_rsip_protected_rx/r_rsip_protected_rx_vx.xx/r_rsip_protected_rx/src/private/rx261/r_rsip_private.c
    }
    else if (RSIP_KEY_HMAC_SHA256 == p_wrapped_key->subtype)
    {
        r_rsip_p76u((const uint32_t*)p_message, r_rsip_byte_to_word_convert((uint32_t)set_prc_byte_size));
        /* Call primitive (cast to match the argument type with the primitive function) */
        rsip_ret = r_rsip_p76f(&gs_hmac_cmd[RSIP_HMAC_CMD_SIGN], NULL, NULL, (uint32_t*)p_mac);

    }
    else
    {
        rsip_ret = RSIP_ERR_FAIL;
    }

    return rsip_ret;
}

rsip_err_t r_rsip_hmac_init_verify(const rsip_wrapped_key_t  * p_wrapped_key,
                                    uint8_t                  * p_message,
                                    uint64_t                   message_length,
                                    const uint8_t            * p_mac,
                                    uint32_t                   mac_length)
{
    rsip_err_t rsip_ret = RSIP_ERR_FAIL;

    uint32_t InData_MAC[RSIP_PRV_WORD_SIZE_HMAC_MAC_BUFFER] =
    {
        0
    };
    uint32_t set_prc_byte_size;
    memcpy(InData_MAC, p_mac, mac_length);
    uint32_t mac_len[1] =
    {
        change_endian_long(mac_length)
    };

    if (RSIP_KEY_HMAC_SHA224 == p_wrapped_key->subtype)
    {
        /* Call primitive (cast to match the argument type with the primitive function) */
        rsip_ret = r_rsip_pdci((uint32_t*)p_wrapped_key->value);

    }
    else if (RSIP_KEY_HMAC_SHA256 == p_wrapped_key->subtype)
    {
        /* Call primitive (cast to match the argument type with the primitive function) */
        rsip_ret = r_rsip_p76i((uint32_t*)p_wrapped_key->value);

    }
    else
    {
        rsip_ret = RSIP_ERR_FAIL;
    }

    if (RSIP_SUCCESS == rsip_ret)
    {
        set_sha2_final_block ((uint8_t *)p_message, message_length, message_length+HMAC_LAST_BLOCK_ADD_LEN,
                        (uint8_t *)p_message, &set_prc_byte_size);
        if (RSIP_KEY_HMAC_SHA224 == p_wrapped_key->subtype)
        {
            r_rsip_pdcu((const uint32_t*)p_message, r_rsip_byte_to_word_convert((uint32_t)set_prc_byte_size));
            /* Call primitive (cast to match the argument type with the primitive function) */
            rsip_ret = r_rsip_pdcf(&gs_hmac_cmd[RSIP_HMAC_CMD_VERIFY], InData_MAC, mac_len, (uint32_t*)NULL);
        }
        else if (RSIP_KEY_HMAC_SHA256 == p_wrapped_key->subtype)
        {
            r_rsip_p76u((const uint32_t*)p_message, r_rsip_byte_to_word_convert((uint32_t)set_prc_byte_size));
            /* Call primitive (cast to match the argument type with the primitive function) */
            rsip_ret = r_rsip_p76f(&gs_hmac_cmd[RSIP_HMAC_CMD_VERIFY], InData_MAC, mac_len, (uint32_t*)NULL);
        }
        else
        {
            rsip_ret = RSIP_ERR_FAIL;
        }
    }

    return rsip_ret;
}

rsip_err_t r_rsip_hmac_verify(const rsip_wrapped_key_t * p_wrapped_key,
                                uint8_t                  * p_message,
                                uint64_t                   message_length,
                                uint64_t                   total_message_length,
                                const uint8_t            * p_mac,
                                uint32_t                   mac_length,
                                uint32_t                 * internal_state)
{
    rsip_err_t rsip_ret = RSIP_ERR_FAIL;
    FSP_PARAMETER_NOT_USED(p_message);
    FSP_PARAMETER_NOT_USED(message_length);
    FSP_PARAMETER_NOT_USED(total_message_length);
    FSP_PARAMETER_NOT_USED(internal_state);

    uint32_t InData_MAC[RSIP_PRV_WORD_SIZE_HMAC_MAC_BUFFER] =
    {
        0
    };

    uint32_t mac_len[1] =
    {
        change_endian_long(mac_length)
    };
    uint32_t set_prc_byte_size;

    set_sha2_final_block ((uint8_t *)p_message, message_length, total_message_length+HMAC_LAST_BLOCK_ADD_LEN,
            (uint8_t *)p_message, &set_prc_byte_size);

    memcpy(InData_MAC, p_mac, mac_length);

    if (RSIP_KEY_HMAC_SHA224 == p_wrapped_key->subtype)
    {
        r_rsip_pdcu((const uint32_t*)p_message, r_rsip_byte_to_word_convert((uint32_t)set_prc_byte_size));
        /* Call primitive (cast to match the argument type with the primitive function) */
        rsip_ret = r_rsip_pdcf(&gs_hmac_cmd[RSIP_HMAC_CMD_VERIFY], InData_MAC, mac_len, (uint32_t*)NULL);
    }
    else if (RSIP_KEY_HMAC_SHA256 == p_wrapped_key->subtype)
    {
        r_rsip_p76u((const uint32_t*)p_message, r_rsip_byte_to_word_convert((uint32_t)set_prc_byte_size));
        /* Call primitive (cast to match the argument type with the primitive function) */
        rsip_ret = r_rsip_p76f(&gs_hmac_cmd[RSIP_HMAC_CMD_VERIFY], InData_MAC, mac_len, (uint32_t*)NULL);
    }
    else
    {
        rsip_ret = RSIP_ERR_FAIL;
    }

    return rsip_ret;
}

RSIP_SEC_P_SECURE_BOOT
/*******************************************************************************************************************//**
 * Select primitive function of initial key wrapping from key type.
 *
 * @param[in] key_type Key type.
 *
 * @return Pointer to function.
 **********************************************************************************************************************/
rsip_func_initial_key_wrap_t select_func_initial_key_wrap(rsip_key_type_t key_type)
{
    rsip_func_initial_key_wrap_t ret = NULL;
    uint8_t alg     = r_rsip_key_type_to_alg(key_type);
    uint8_t subtype = r_rsip_key_type_to_subtype(key_type);

    switch (alg)
    {
        case RSIP_ALG_AES:
        {
            ret = gsp_func_initial_key_wrap_aes[subtype];
            break;
        }
        case RSIP_ALG_ECC_PUBLIC:
        {
            ret = gsp_func_initial_key_wrap_ecc_pub[subtype];
            break;
        }

        case RSIP_ALG_ECC_PRIVATE:
        {
            ret = gsp_func_initial_key_wrap_ecc_priv[subtype];
            break;
        }

        case RSIP_ALG_HMAC:
        {
            ret = gsp_func_initial_key_wrap_hmac[subtype];
            break;
        }

        default:
        {
            /* Do nothing */
        }
    }

    return ret;
}
RSIP_SEC_DEFAULT
/*******************************************************************************************************************//**
 * Set sha final block.
 *
 * @param[in] p_message      last block_message.
 * @param[in] message_length message length.
 * @param[in] total_message_length all sha message length.
 * @param[in] p_last_block        last block data(this area is need 128byte) this area is .
 * @param[in] p_last_block_length last block length.
 *
 * @return void.
 **********************************************************************************************************************/
static void set_sha2_final_block(uint8_t * p_message,
                                uint32_t message_length,
                                uint32_t total_message_length,
                                uint8_t * p_last_block,
                                uint32_t * p_last_block_length)
{
    memset(&p_last_block[message_length], 0 , SHA_BLOCK8_LEN * 2 - message_length);    
    memcpy(p_last_block, p_message, message_length);
    p_last_block[message_length] = SHA_STOP_BIT;
    if ((SHA_BLOCK8_LEN - message_length) >= 9) /* another block unnecessary */
    {
        /* According c., but support only l < 2**32 case */
        /* Casting uint32_t data to uint8_t data array. */
        p_last_block[SHA_BLOCK8_LEN - 4] = (uint8_t) ((total_message_length * 8) >> 24);
        /* Casting uint32_t data to uint8_t data array. */
        p_last_block[SHA_BLOCK8_LEN - 3] = (uint8_t) (((total_message_length * 8) >> 16) & 0xff);
        /* Casting uint32_t data to uint8_t data array. */
        p_last_block[SHA_BLOCK8_LEN - 2] = (uint8_t) (((total_message_length * 8) >> 8) & 0xff);
        /* Casting uint32_t data to uint8_t data array. */
        p_last_block[SHA_BLOCK8_LEN - 1] = (uint8_t) ((total_message_length * 8) & 0xff);
        p_last_block_length[0] = SHA_BLOCK8_LEN;
    }
    else
    {
        /* another block necessary */
        /* Casting uint32_t data to uint8_t data array. */
        p_last_block[(2 * SHA_BLOCK8_LEN) - 4] = (uint8_t) ((total_message_length * 8) >> 24);
        /* Casting uint32_t data to uint8_t data array. */
        p_last_block[(2 * SHA_BLOCK8_LEN) - 3] = (uint8_t) (((total_message_length * 8) >> 16) & 0xff);
        /* Casting uint32_t data to uint8_t data array. */
        p_last_block[(2 * SHA_BLOCK8_LEN) - 2] = (uint8_t) (((total_message_length * 8) >> 8) & 0xff);
        /* Casting uint32_t data to uint8_t data array. */
        p_last_block[(2 * SHA_BLOCK8_LEN) - 1] = (uint8_t) ((total_message_length * 8) & 0xff);
        p_last_block_length[0] = 2 * SHA_BLOCK8_LEN;
    }

    return;
}
